app/views/sightings/new.html.erb

SELECT "regions".* FROM "regions"
---
  <select id="sighting_region_id" name = 'sighting[region_id]'>
    <% Region.all.each do |region| %>