app/views/species/index.html.erb

SELECT "sightings".* FROM "sightings" WHERE "sightings"."specie_id" = $1  [["specie_id", 1]]
---
    <li><a href="/species/<%= specie.id %>"><%= specie.name %></a></li>
        <% specie.sightings.each do |sighting| %>