app/views/species/show.html.erb


 <% @specie.sightings.each do |sighting| %>
---
SELECT "sightings".* FROM "sightings" WHERE "sightings"."specie_id" = $1  [["specie_id", 1]]