app/controllers/regions_controller.rb

  def new
    @region = Region.new
    @sighting = Sighting.find(params[:sighting_id])
    specie_id = @sighting.specie_id
    @specie = Specie.where(:id => specie_id).first
---
SELECT  "sightings".* FROM "sightings" WHERE "sightings"."id" = $1 LIMIT 1  [["id", 14]]
SELECT  "species".* FROM "species" WHERE "species"."id" = $1  ORDER BY "species"."id" ASC LIMIT 1  [["id", 14]]

  def create
  	@region = Region.new(:name=> params[:name])
    @region.save
    @sighting = Sighting.find(params[:sighting_id])
    specie_id = @sighting.specie_id
    @specie = Specie.where(:id => specie_id).first
    @sighting.update_ids(@specie.id, @region.id)
---
INSERT INTO "regions" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Northwest"], ["created_at", "2015-01-12 21:21:31.549986"], ["updated_at", "2015-01-12 21:21:31.549986"]]
SELECT  "sightings".* FROM "sightings" WHERE "sightings"."id" = $1 LIMIT 1  [["id", nil]]
SELECT  "species".* FROM "species" WHERE "species"."id" = $1  ORDER BY "species"."id" ASC LIMIT 1  [["id", 12]]
UPDATE "sightings" SET "region_id" = $1 WHERE "sightings"."id" = $2  [["region_id", 17], ["id", 33]]