app/controllers/sightings_controller.rb

SELECT  "species".* FROM "species" WHERE "species"."id" = $1 LIMIT 1  [["id", nil]]
---
  def new
    specie = Specie.find(params[:specie_id])

INSERT INTO "sightings" ("date", "specie_id") VALUES ($1, $2) RETURNING "id"  [["date", "2015-01-11"], ["specie_id", 1]]
---
  def create
  	@sighting = Sighting.new(:date => params[:date], :specie_id => params[:specie_id])

    if @sighting.save