app/controllers/species_controller.rb

  def index
    @species = Specie.all
---
SELECT "species".* FROM "species"

  def create
  	@specie = Specie.new(params[:specie])

    if @specie.save
---
INSERT INTO "species" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Blue Bird"], ["created_at", "2015-01-10 16:16:27.258404"], ["updated_at", "2015-01-10 16:16:27.258404"]]

  def show
    @specie = Specie.find(params[:id]) #ie, the specie when this action occurs is the specie matching the id that was entered (correponding to the ":id" in the route)
---
SELECT  "species".* FROM "species" WHERE "species"."id" = $1 LIMIT 1  [["id", 5]]